from telegram import Update
from telegram.ext import ContextTypes


async def boj(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
🏦 بانک مرکزی ژاپن (BOJ)

بانک مرکزی ژاپن یا Bank of Japan (BOJ) بانک مرکزی کشور ژاپن است که مسئول اجرای سیاست‌های پولی، حفظ ثبات قیمت‌ها، کنترل تورم و حمایت از رشد اقتصادی این کشور می‌باشد.

BOJ یکی از فعال‌ترین بانک‌های مرکزی جهان در اجرای سیاست‌های پولی انبساطی است و سال‌ها از ابزارهایی مانند نرخ بهره بسیار پایین، نرخ بهره منفی و خرید گسترده اوراق قرضه و صندوق‌های سرمایه‌گذاری (ETF) برای تحریک اقتصاد استفاده کرده است.

تصمیمات بانک مرکزی ژاپن در جلسات سیاست‌گذاری پولی منتشر می‌شود و نقش مهمی در تعیین ارزش ین ژاپن و شرایط مالی این کشور دارد.

🎯 اهمیت:
تصمیمات BOJ می‌تواند بر ارزش ین ژاپن، بازار فارکس، شاخص دلار، قیمت طلا، بازار سهام آسیا و جریان سرمایه در بازارهای جهانی تأثیر قابل توجهی داشته باشد.
"""

    await update.message.reply_text(text)