from telegram import Update
from telegram.ext import ContextTypes


async def budget_deficit(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
📉 کسری بودجه (Budget Deficit)

کسری بودجه زمانی رخ می‌دهد که مجموع هزینه‌های دولت از درآمدهای آن در یک دوره زمانی بیشتر باشد. در این شرایط، دولت برای جبران این کمبود معمولاً از طریق استقراض، انتشار اوراق بدهی یا افزایش پایه پولی و چاپ پول منابع مالی مورد نیاز خود را تأمین می‌کند.

ادامه‌دار بودن کسری بودجه می‌تواند موجب افزایش بدهی دولت، رشد نقدینگی، افزایش تورم و کاهش ارزش پول ملی شود. به همین دلیل کنترل کسری بودجه یکی از مهم‌ترین اهداف سیاست‌های مالی دولت‌ها است.

🎯 اهمیت:
کسری بودجه یکی از شاخص‌های مهم سلامت مالی دولت‌ها محسوب می‌شود و تأثیر مستقیمی بر تورم، نرخ ارز، نرخ بهره، ارزش اوراق قرضه، قیمت طلا و وضعیت کلی اقتصاد دارد.
"""

    await update.message.reply_text(text)