from telegram import Update
from telegram.ext import ContextTypes


async def consumer_confidence(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
👥 شاخص اعتماد مصرف‌کننده (Consumer Confidence)

شاخص اعتماد مصرف‌کننده یا Consumer Confidence میزان خوش‌بینی یا بدبینی خانوارها نسبت به وضعیت فعلی و آینده اقتصاد را اندازه‌گیری می‌کند. این شاخص بر اساس نظرسنجی از مصرف‌کنندگان درباره درآمد، اشتغال، شرایط اقتصادی و تمایل به خرید کالاها محاسبه می‌شود.

هرچه اعتماد مصرف‌کنندگان بیشتر باشد، احتمال افزایش هزینه‌کرد و مصرف نیز بیشتر خواهد بود که می‌تواند به رشد اقتصادی کمک کند. در مقابل، کاهش اعتماد مصرف‌کنندگان معمولاً باعث کاهش خرید، افت تقاضا و کند شدن رشد اقتصادی می‌شود.

🎯 اهمیت:
شاخص اعتماد مصرف‌کننده یکی از شاخص‌های پیشرو اقتصاد است و می‌تواند بر بازارهای سهام، ارزش دلار، قیمت طلا، نرخ بهره و تصمیمات سرمایه‌گذاران تأثیر قابل توجهی داشته باشد.
"""

    await update.message.reply_text(text)