from telegram import Update
from telegram.ext import ContextTypes


async def core_cpi(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
📉 شاخص قیمت مصرف‌کننده هسته‌ای (Core CPI)

Core CPI نسخه‌ای از شاخص قیمت مصرف‌کننده (CPI) است که قیمت مواد غذایی و انرژی را از محاسبات حذف می‌کند. دلیل این کار، نوسانات شدید این دو بخش است که می‌تواند تصویر واقعی تورم را مخدوش کند.

اقتصاددانان و بانک‌های مرکزی از Core CPI برای ارزیابی روند بلندمدت تورم استفاده می‌کنند، زیرا این شاخص تغییرات پایدارتر قیمت‌ها را بهتر نشان می‌دهد.

🎯 اهمیت:
Core CPI یکی از مهم‌ترین معیارهای تصمیم‌گیری بانک‌های مرکزی، به‌ویژه فدرال رزرو آمریکا، برای تعیین نرخ بهره و سیاست‌های پولی محسوب می‌شود و تأثیر زیادی بر بازارهای طلا، دلار و سهام دارد.
"""

    await update.message.reply_text(text)