from telegram import Update
from telegram.ext import ContextTypes


async def current_account(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
🌐 حساب جاری (Current Account)

حساب جاری یکی از مهم‌ترین بخش‌های تراز پرداخت‌های یک کشور است و تمام مبادلات اقتصادی با سایر کشورها را شامل می‌شود. این حساب شامل صادرات و واردات کالا و خدمات، درآمدهای حاصل از سرمایه‌گذاری و انتقالات مالی مانند حواله‌ها و کمک‌های خارجی است.

اگر درآمدهای حاصل از صادرات و سایر دریافت‌های خارجی بیشتر از پرداخت‌ها باشد، کشور دارای مازاد حساب جاری است. در مقابل، اگر پرداخت‌ها بیشتر از درآمدها باشد، کسری حساب جاری ایجاد می‌شود.

🎯 اهمیت:
حساب جاری نشان‌دهنده وضعیت مالی یک کشور در تجارت بین‌الملل است و تأثیر مستقیمی بر ارزش پول ملی، نرخ ارز، سرمایه‌گذاری خارجی، رشد اقتصادی و تصمیمات سیاست‌گذاران اقتصادی دارد.
"""

    await update.message.reply_text(text)