from telegram import Update
from telegram.ext import ContextTypes


async def dot_plot(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
🎯 دات پلات (Dot Plot)

دات پلات یا Dot Plot نموداری است که توسط اعضای کمیته بازار آزاد فدرال رزرو (FOMC) منتشر می‌شود و پیش‌بینی هر عضو از نرخ بهره در سال‌های آینده را نشان می‌دهد. هر نقطه روی نمودار نمایانگر نظر یک عضو درباره سطح مناسب نرخ بهره در پایان هر سال است.

این نمودار تضمین‌کننده تصمیمات آینده فدرال رزرو نیست، اما دیدگاه سیاست‌گذاران پولی را درباره مسیر احتمالی نرخ بهره و وضعیت اقتصاد آمریکا نمایش می‌دهد.

🎯 اهمیت:
دات پلات یکی از مهم‌ترین گزارش‌های فدرال رزرو است و می‌تواند باعث نوسانات شدید در بازارهای مالی شود. سرمایه‌گذاران از آن برای پیش‌بینی روند نرخ بهره، ارزش دلار، قیمت طلا، بازار سهام و ارزهای دیجیتال استفاده می‌کنند.
"""

    await update.message.reply_text(text)