from telegram import Update
from telegram.ext import ContextTypes


async def dxy(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
💲 شاخص دلار آمریکا (DXY)

شاخص دلار آمریکا یا U.S. Dollar Index (DXY) ارزش دلار آمریکا را در برابر سبدی از ارزهای معتبر جهان اندازه‌گیری می‌کند. این سبد شامل یورو، ین ژاپن، پوند انگلیس، دلار کانادا، کرون سوئد و فرانک سوئیس است.

افزایش شاخص DXY نشان‌دهنده تقویت دلار آمریکا و کاهش آن بیانگر تضعیف دلار در برابر سایر ارزهای مهم جهان است. معامله‌گران از این شاخص برای تحلیل روند بازارهای مالی و پیش‌بینی حرکت سرمایه استفاده می‌کنند.

🎯 اهمیت:
شاخص DXY رابطه معکوسی با قیمت طلا دارد و معمولاً با تقویت دلار، قیمت طلا کاهش می‌یابد. همچنین این شاخص بر بازار فارکس، کالاها، بورس جهانی و ارزهای دیجیتال تأثیر قابل‌توجهی دارد و یکی از مهم‌ترین شاخص‌های اقتصاد جهانی محسوب می‌شود.
"""

    await update.message.reply_text(text)