from telegram import Update
from telegram.ext import ContextTypes


async def ecb(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
🏦 بانک مرکزی اروپا (ECB)

بانک مرکزی اروپا یا European Central Bank (ECB) نهاد مسئول سیاست‌های پولی کشورهای عضو منطقه یورو است. وظیفه اصلی این بانک حفظ ثبات قیمت‌ها، کنترل تورم و حمایت از رشد پایدار اقتصادی در کشورهای استفاده‌کننده از ارز یورو می‌باشد.

ECB با استفاده از ابزارهایی مانند تعیین نرخ بهره، خرید و فروش اوراق قرضه، مدیریت نقدینگی و اجرای سیاست‌های پولی، تلاش می‌کند ارزش یورو را حفظ کرده و ثبات مالی منطقه یورو را تضمین کند.

تصمیمات بانک مرکزی اروپا معمولاً در جلسات شورای حکام (Governing Council) اتخاذ شده و به صورت منظم منتشر می‌شود.

🎯 اهمیت:
تصمیمات ECB تأثیر مستقیمی بر ارزش یورو، شاخص دلار، قیمت طلا، بازارهای سهام اروپا، اوراق قرضه و بازارهای مالی جهان دارد و از مهم‌ترین بانک‌های مرکزی جهان محسوب می‌شود.
"""

    await update.message.reply_text(text)