from telegram import Update
from telegram.ext import ContextTypes


async def exchange_rate(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
💱 نرخ ارز (Exchange Rate)

نرخ ارز به ارزش یک واحد پول یک کشور در برابر پول کشور دیگر گفته می‌شود. این نرخ نشان می‌دهد برای خرید یک واحد ارز خارجی چه مقدار از پول داخلی باید پرداخت شود. نرخ ارز تحت تأثیر عواملی مانند عرضه و تقاضا، تورم، نرخ بهره، رشد اقتصادی، سیاست‌های بانک مرکزی، تراز تجاری و رویدادهای سیاسی قرار دارد.

در اقتصادهای آزاد، نرخ ارز عمدتاً توسط عرضه و تقاضای بازار تعیین می‌شود، اما در برخی کشورها دولت یا بانک مرکزی نیز در تعیین یا کنترل آن نقش دارد.

🎯 اهمیت:
نرخ ارز یکی از مهم‌ترین شاخص‌های اقتصادی است و تغییرات آن بر قیمت کالاهای وارداتی، صادرات، تورم، ارزش پول ملی، قیمت طلا، بازار سهام و تصمیمات سرمایه‌گذاران تأثیر مستقیم دارد.
"""

    await update.message.reply_text(text)