from telegram import Update
from telegram.ext import ContextTypes


async def federal_reserve(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
🏦 فدرال رزرو آمریکا (Federal Reserve)

فدرال رزرو یا Fed بانک مرکزی ایالات متحده آمریکا است که مسئول اجرای سیاست‌های پولی، کنترل تورم، حفظ ثبات اقتصادی، نظارت بر نظام بانکی و مدیریت عرضه پول در اقتصاد آمریکا می‌باشد.

این نهاد با استفاده از ابزارهایی مانند تعیین نرخ بهره، عملیات بازار باز، تسهیل کمی (QE) و انقباض کمی (QT) تلاش می‌کند تورم را کنترل کرده، اشتغال را افزایش دهد و رشد اقتصادی پایدار را حفظ کند.

تصمیمات فدرال رزرو توسط کمیته بازار آزاد فدرال (FOMC) اتخاذ می‌شود و معمولاً هشت بار در سال درباره نرخ بهره و سیاست‌های پولی تصمیم‌گیری می‌شود.

🎯 اهمیت:
تصمیمات فدرال رزرو از مهم‌ترین عوامل تأثیرگذار بر اقتصاد جهان است و می‌تواند باعث نوسانات قابل توجه در بازارهای طلا، دلار، بورس، اوراق قرضه، فارکس و ارزهای دیجیتال شود.
"""

    await update.message.reply_text(text)