from telegram import Update
from telegram.ext import ContextTypes


async def fomc(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
🏦 کمیته بازار آزاد فدرال (FOMC)

FOMC یا Federal Open Market Committee کمیته سیاست‌گذاری پولی بانک مرکزی آمریکا (فدرال رزرو) است که درباره نرخ بهره، کنترل تورم، حجم نقدینگی و سایر سیاست‌های پولی تصمیم‌گیری می‌کند. این کمیته معمولاً هشت بار در سال جلسه برگزار کرده و نتیجه تصمیمات خود را به صورت رسمی منتشر می‌کند.

تصمیمات FOMC می‌تواند مسیر اقتصاد آمریکا و حتی اقتصاد جهانی را تغییر دهد، زیرا دلار آمریکا مهم‌ترین ارز ذخیره جهان است.

🎯 اهمیت:
جلسات FOMC یکی از مهم‌ترین رویدادهای اقتصادی جهان محسوب می‌شوند و تصمیمات این کمیته تأثیر مستقیمی بر ارزش دلار، قیمت طلا، بازار سهام، اوراق قرضه، ارزهای دیجیتال و سایر بازارهای مالی دارد.
"""

    await update.message.reply_text(text)