from telegram import Update
from telegram.ext import ContextTypes


async def gdp(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
🌍 تولید ناخالص داخلی (GDP)

تولید ناخالص داخلی یا Gross Domestic Product (GDP) ارزش کل کالاها و خدمات نهایی تولید شده در داخل مرزهای یک کشور طی یک دوره زمانی مشخص، معمولاً یک سال یا یک فصل، است. GDP یکی از مهم‌ترین معیارها برای اندازه‌گیری اندازه و سلامت اقتصاد یک کشور محسوب می‌شود.

رشد GDP نشان‌دهنده افزایش فعالیت‌های اقتصادی، تولید، سرمایه‌گذاری و مصرف است، در حالی که کاهش یا رشد منفی آن می‌تواند نشانه رکود اقتصادی باشد.

🎯 اهمیت:
GDP یکی از مهم‌ترین شاخص‌های اقتصادی جهان است و بر ارزش پول ملی، بازار سهام، نرخ بهره، سرمایه‌گذاری، اشتغال و تصمیمات بانک‌های مرکزی تأثیر مستقیم دارد.
"""

    await update.message.reply_text(text)