from telegram import Update
from telegram.ext import ContextTypes


async def government_debt(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
🏛 بدهی دولت (Government Debt)

بدهی دولت به مجموع تعهدات مالی دولت گفته می‌شود که در نتیجه استقراض از مردم، بانک‌ها، بانک مرکزی یا سایر کشورها ایجاد شده است. دولت‌ها معمولاً برای تأمین کسری بودجه، اجرای پروژه‌های عمرانی یا مقابله با بحران‌های اقتصادی اقدام به استقراض می‌کنند.

اگرچه بدهی دولت در بسیاری از کشورها امری طبیعی است، اما افزایش بیش از حد آن می‌تواند موجب افزایش هزینه‌های بهره، کاهش اعتماد سرمایه‌گذاران، فشار بر بودجه و در نهایت کند شدن رشد اقتصادی شود.

🎯 اهمیت:
میزان بدهی دولت یکی از شاخص‌های مهم سلامت اقتصادی کشورها است و می‌تواند بر نرخ بهره، ارزش پول ملی، بازار اوراق قرضه، بازار سهام، تورم و تصمیمات سرمایه‌گذاران تأثیر مستقیم داشته باشد.
"""

    await update.message.reply_text(text)