from telegram import Update
from telegram.ext import ContextTypes


async def inflation_expectation(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
💬 انتظارات تورمی (Inflation Expectations)

انتظارات تورمی به پیش‌بینی مردم، سرمایه‌گذاران، شرکت‌ها و فعالان اقتصادی درباره میزان تورم در آینده گفته می‌شود. این انتظارات نقش مهمی در تصمیمات اقتصادی افراد دارد؛ زیرا اگر مردم انتظار افزایش قیمت‌ها را داشته باشند، رفتار مالی و سرمایه‌گذاری خود را تغییر می‌دهند.

افزایش انتظارات تورمی می‌تواند باعث افزایش تقاضا، رشد دستمزدها، افزایش قیمت کالاها و در نهایت تشدید تورم شود. به همین دلیل بانک‌های مرکزی علاوه بر کنترل تورم، تلاش می‌کنند انتظارات تورمی را نیز مدیریت کنند.

🎯 اهمیت:
انتظارات تورمی یکی از مهم‌ترین عوامل تأثیرگذار بر نرخ بهره، ارزش پول، قیمت طلا، بازار سهام و تصمیمات بانک‌های مرکزی است و می‌تواند مسیر آینده اقتصاد را تحت تأثیر قرار دهد.
"""

    await update.message.reply_text(text)