from telegram import Update
from telegram.ext import ContextTypes


async def inflation(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
📈 تورم (Inflation)

تورم به معنای افزایش مداوم و عمومی قیمت کالاها و خدمات در یک اقتصاد است. با افزایش تورم، قدرت خرید پول کاهش می‌یابد؛ یعنی با مقدار ثابتی پول، کالاها و خدمات کمتری می‌توان خرید.

تورم معمولاً در اثر افزایش نقدینگی، رشد هزینه‌های تولید، افزایش تقاضا، نوسانات نرخ ارز یا سیاست‌های پولی و مالی دولت‌ها ایجاد می‌شود. بانک‌های مرکزی تلاش می‌کنند با کنترل نرخ بهره و حجم پول، تورم را در سطحی متعادل حفظ کنند.

🎯 اهمیت:
تورم یکی از مهم‌ترین شاخص‌های اقتصادی است و تأثیر مستقیمی بر قیمت طلا، ارز، بورس، نرخ بهره، هزینه‌های زندگی و تصمیمات سرمایه‌گذاران دارد.
"""

    await update.message.reply_text(text)