from telegram import Update
from telegram.ext import ContextTypes


async def interest_rate(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
💰 نرخ بهره (Interest Rate)

نرخ بهره، هزینه دریافت وام یا پاداش سپرده‌گذاری پول است که توسط بانک‌های مرکزی و بانک‌های تجاری تعیین می‌شود. بانک‌های مرکزی از نرخ بهره به عنوان یکی از مهم‌ترین ابزارهای سیاست پولی برای کنترل تورم، رشد اقتصادی و نقدینگی استفاده می‌کنند.

افزایش نرخ بهره معمولاً باعث کاهش وام‌گیری، کاهش مصرف و سرمایه‌گذاری و در نتیجه کاهش تورم می‌شود. در مقابل، کاهش نرخ بهره موجب افزایش وام‌گیری، رشد سرمایه‌گذاری و تحریک اقتصاد خواهد شد.

🎯 اهمیت:
نرخ بهره یکی از مهم‌ترین عوامل تأثیرگذار بر ارزش دلار، قیمت طلا، بازار سهام، بازار اوراق قرضه، ارزهای دیجیتال و تصمیمات سرمایه‌گذاران در سراسر جهان است.
"""

    await update.message.reply_text(text)