from telegram import Update
from telegram.ext import ContextTypes


async def liquidity(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
💸 نقدینگی (Liquidity)

نقدینگی به مجموع پول و شبه‌پول موجود در اقتصاد گفته می‌شود که قابلیت تبدیل سریع به پول و استفاده برای خرید کالا، خدمات یا سرمایه‌گذاری را دارد. رشد بیش از حد نقدینگی، در صورتی که با افزایش تولید همراه نباشد، می‌تواند موجب افزایش تورم و کاهش ارزش پول شود.

بانک‌های مرکزی با استفاده از ابزارهایی مانند نرخ بهره، عملیات بازار باز و سیاست‌های پولی، میزان نقدینگی را مدیریت می‌کنند تا ثبات اقتصادی حفظ شود.

🎯 اهمیت:
نقدینگی یکی از مهم‌ترین عوامل تأثیرگذار بر تورم، نرخ ارز، قیمت طلا، بازار سهام، مسکن و سایر دارایی‌ها است و افزایش یا کاهش آن می‌تواند جهت حرکت بازارهای مالی را تغییر دهد.
"""

    await update.message.reply_text(text)