from telegram import Update
from telegram.ext import ContextTypes


async def monetary_base(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
🏛 پایه پولی (Monetary Base)

پایه پولی یا Monetary Base که به آن «پول پرقدرت» نیز گفته می‌شود، شامل اسکناس و مسکوک در دست مردم به‌علاوه ذخایر بانک‌ها نزد بانک مرکزی است. این شاخص پایه اصلی خلق پول در اقتصاد محسوب می‌شود و هرگونه تغییر در آن می‌تواند چندین برابر بر حجم نقدینگی اثر بگذارد.

افزایش پایه پولی معمولاً از طریق چاپ پول، خرید دارایی‌ها توسط بانک مرکزی یا افزایش بدهی بانک‌ها به بانک مرکزی رخ می‌دهد و در صورت کنترل نشدن، می‌تواند منجر به رشد نقدینگی و افزایش تورم شود.

🎯 اهمیت:
پایه پولی یکی از مهم‌ترین شاخص‌های سیاست پولی است و نقش تعیین‌کننده‌ای در تورم، ارزش پول ملی، نرخ ارز، قیمت طلا و ثبات اقتصادی دارد. اقتصاددانان از آن برای ارزیابی وضعیت پولی کشور و پیش‌بینی روند تورم استفاده می‌کنند.
"""

    await update.message.reply_text(text)