from telegram import Update
from telegram.ext import ContextTypes


async def nfp(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
💼 گزارش اشتغال غیرکشاورزی (NFP)

NFP یا Non-Farm Payrolls یکی از مهم‌ترین گزارش‌های اقتصادی آمریکا است که تعداد مشاغل ایجاد شده یا از دست رفته در بخش‌های غیرکشاورزی را در هر ماه نشان می‌دهد. این گزارش توسط اداره آمار کار آمریکا (BLS) منتشر می‌شود و وضعیت بازار کار و سلامت اقتصاد را ارزیابی می‌کند.

افزایش تعداد مشاغل معمولاً نشانه رشد اقتصادی و قدرت بازار کار است، در حالی که کاهش آن می‌تواند هشداری برای کند شدن اقتصاد یا رکود باشد.

🎯 اهمیت:
گزارش NFP یکی از تأثیرگذارترین اخبار اقتصادی جهان است و معمولاً باعث نوسانات شدید در بازارهای طلا، دلار، فارکس، بورس و ارزهای دیجیتال می‌شود. سرمایه‌گذاران از این گزارش برای پیش‌بینی تصمیمات آینده فدرال رزرو درباره نرخ بهره استفاده می‌کنند.
"""

    await update.message.reply_text(text)