from telegram import Update
from telegram.ext import ContextTypes


async def pce(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
💳 شاخص مخارج مصرف شخصی (PCE)

PCE یا Personal Consumption Expenditures Price Index شاخصی است که میانگین تغییرات قیمت کالاها و خدمات مصرفی خانوارهای آمریکایی را اندازه‌گیری می‌کند. این شاخص توسط اداره تحلیل اقتصادی آمریکا (BEA) منتشر می‌شود و معیار اصلی فدرال رزرو برای ارزیابی تورم به شمار می‌رود.

برخلاف شاخص CPI، در محاسبه PCE تغییر الگوی مصرف خانوارها نیز در نظر گرفته می‌شود؛ به همین دلیل بسیاری از اقتصاددانان آن را معیار دقیق‌تری برای سنجش تورم می‌دانند.

🎯 اهمیت:
شاخص PCE مهم‌ترین معیار تورمی مورد استفاده فدرال رزرو است و نقش مهمی در تصمیم‌گیری درباره نرخ بهره دارد. انتشار این گزارش می‌تواند بر ارزش دلار، قیمت طلا، بازار سهام، اوراق قرضه و ارزهای دیجیتال تأثیر قابل‌توجهی بگذارد.
"""

    await update.message.reply_text(text)