from telegram import Update
from telegram.ext import ContextTypes


async def pmi(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
🏢 شاخص مدیران خرید (PMI)

PMI یا Purchasing Managers' Index یکی از مهم‌ترین شاخص‌های اقتصادی پیشرو است که وضعیت فعالیت شرکت‌های تولیدی و خدماتی را بر اساس نظرسنجی از مدیران خرید اندازه‌گیری می‌کند. این شاخص اطلاعاتی درباره سفارشات جدید، تولید، اشتغال، موجودی انبار و سرعت تحویل تأمین‌کنندگان ارائه می‌دهد.

عدد PMI بالاتر از ۵۰ نشان‌دهنده رشد و رونق اقتصادی است، در حالی که عدد کمتر از ۵۰ بیانگر کاهش فعالیت‌های اقتصادی و احتمال ورود اقتصاد به رکود است.

🎯 اهمیت:
PMI یکی از اولین گزارش‌هایی است که هر ماه منتشر می‌شود و به همین دلیل سرمایه‌گذاران از آن برای ارزیابی وضعیت اقتصاد، پیش‌بینی رشد اقتصادی و تصمیم‌گیری درباره بازارهای طلا، دلار، بورس و ارزهای دیجیتال استفاده می‌کنند.
"""

    await update.message.reply_text(text)