from telegram import Update
from telegram.ext import ContextTypes


async def ppi(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
🏭 شاخص قیمت تولیدکننده (PPI)

شاخص قیمت تولیدکننده یا Producer Price Index (PPI) میانگین تغییرات قیمت کالاها و خدمات را از دید تولیدکنندگان اندازه‌گیری می‌کند. این شاخص نشان می‌دهد که هزینه تولید محصولات نسبت به گذشته چقدر افزایش یا کاهش یافته است.

از آنجا که افزایش هزینه‌های تولید معمولاً با تأخیر به مصرف‌کننده منتقل می‌شود، PPI یکی از شاخص‌های پیشرو برای پیش‌بینی تورم آینده محسوب می‌شود.

🎯 اهمیت:
سرمایه‌گذاران، تحلیلگران و بانک‌های مرکزی از PPI برای ارزیابی فشارهای تورمی و پیش‌بینی روند آینده اقتصاد استفاده می‌کنند. تغییرات این شاخص می‌تواند بر نرخ بهره، ارزش دلار، قیمت طلا و بازار سهام تأثیرگذار باشد.
"""

    await update.message.reply_text(text)