from telegram import Update
from telegram.ext import ContextTypes


async def purchasing_power(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
💰 قدرت خرید (Purchasing Power)

قدرت خرید به میزان کالاها و خدماتی گفته می‌شود که با مقدار مشخصی پول می‌توان خریداری کرد. هرچه ارزش پول بیشتر باشد، قدرت خرید نیز بالاتر خواهد بود و افراد می‌توانند کالاها و خدمات بیشتری تهیه کنند. در مقابل، افزایش تورم و کاهش ارزش پول باعث کاهش قدرت خرید می‌شود.

قدرت خرید یکی از مهم‌ترین شاخص‌های رفاه اقتصادی مردم است و تغییرات آن به طور مستقیم بر سطح زندگی، میزان مصرف، پس‌انداز و سرمایه‌گذاری تأثیر می‌گذارد.

🎯 اهمیت:
قدرت خرید یکی از مهم‌ترین معیارهای سنجش وضعیت اقتصادی خانوارها است و کاهش آن معمولاً نتیجه تورم، افزایش قیمت‌ها و افت ارزش پول ملی است. سرمایه‌گذاران نیز از این شاخص برای ارزیابی شرایط اقتصادی و انتخاب دارایی‌های مناسب مانند طلا، ارز و سهام استفاده می‌کنند.
"""

    await update.message.reply_text(text)