from telegram import Update
from telegram.ext import ContextTypes


async def qe(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
💵 تسهیل کمی (QE)

QE یا Quantitative Easing به معنای «تسهیل کمی» یکی از ابزارهای سیاست پولی بانک‌های مرکزی است. در این روش، بانک مرکزی با خرید اوراق قرضه دولتی و سایر دارایی‌های مالی، پول جدید وارد اقتصاد می‌کند تا نقدینگی افزایش یابد و هزینه وام‌گیری کاهش پیدا کند.

هدف از اجرای QE، تحریک رشد اقتصادی، افزایش سرمایه‌گذاری، کاهش نرخ بهره و جلوگیری از رکود یا بحران‌های مالی است. این سیاست معمولاً در شرایطی اجرا می‌شود که کاهش نرخ بهره به تنهایی برای حمایت از اقتصاد کافی نباشد.

🎯 اهمیت:
اجرای QE معمولاً باعث افزایش نقدینگی، تضعیف ارزش پول ملی، رشد بازار سهام، افزایش قیمت طلا و تقویت دارایی‌های پرریسک مانند ارزهای دیجیتال می‌شود و از مهم‌ترین سیاست‌های پولی بانک‌های مرکزی جهان محسوب می‌شود.
"""

    await update.message.reply_text(text)