from telegram import Update
from telegram.ext import ContextTypes


async def qt(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
📉 سیاست انقباض کمی (QT)

QT یا Quantitative Tightening به معنای «انقباض کمی» سیاستی است که بانک‌های مرکزی برای کاهش نقدینگی و کنترل تورم اجرا می‌کنند. در این روش، بانک مرکزی خرید اوراق قرضه را متوقف کرده یا بخشی از دارایی‌های خود را به بازار می‌فروشد تا حجم پول در گردش کاهش یابد.

هدف اصلی QT کاهش فشارهای تورمی، کنترل رشد نقدینگی و بازگرداندن تعادل به اقتصاد است. این سیاست معمولاً پس از دوره‌های اجرای QE و زمانی که تورم افزایش یافته باشد، اجرا می‌شود.

🎯 اهمیت:
اجرای QT معمولاً باعث تقویت ارزش پول ملی، افزایش نرخ بهره، کاهش نقدینگی و فشار بر بازارهای سهام، طلا و ارزهای دیجیتال می‌شود. به همین دلیل سرمایه‌گذاران تصمیمات بانک‌های مرکزی درباره QT را با دقت دنبال می‌کنند.
"""

    await update.message.reply_text(text)