from telegram import Update
from telegram.ext import ContextTypes


async def recession(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
📉 رکود اقتصادی (Recession)

رکود اقتصادی به دوره‌ای گفته می‌شود که فعالیت‌های اقتصادی یک کشور به طور قابل توجهی کاهش می‌یابد. در این دوره معمولاً تولید، سرمایه‌گذاری، مصرف، اشتغال و درآمد خانوارها کاهش پیدا می‌کند و رشد اقتصادی منفی یا بسیار ضعیف می‌شود.

در بسیاری از کشورها، اگر تولید ناخالص داخلی (GDP) دو فصل متوالی رشد منفی داشته باشد، اقتصاد وارد رکود شده است؛ هرچند اقتصاددانان برای تشخیص رکود، شاخص‌های دیگری مانند نرخ بیکاری، تولید صنعتی و میزان مصرف را نیز بررسی می‌کنند.

🎯 اهمیت:
رکود اقتصادی معمولاً باعث کاهش سود شرکت‌ها، افت بازار سهام، افزایش نرخ بیکاری و کاهش تقاضا می‌شود. همچنین بانک‌های مرکزی در زمان رکود معمولاً با کاهش نرخ بهره و اجرای سیاست‌های حمایتی تلاش می‌کنند اقتصاد را دوباره به مسیر رشد بازگردانند.
"""

    await update.message.reply_text(text)