from telegram import Update
from telegram.ext import ContextTypes


async def retail_sales(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
🛒 شاخص خرده‌فروشی (Retail Sales)

شاخص خرده‌فروشی یا Retail Sales میزان فروش کالاها و خدمات در فروشگاه‌های خرده‌فروشی را اندازه‌گیری می‌کند و یکی از مهم‌ترین شاخص‌های سنجش قدرت مصرف‌کنندگان و وضعیت اقتصاد است. این گزارش معمولاً به صورت ماهانه منتشر می‌شود و نشان می‌دهد خانوارها چه میزان برای خرید کالاهای مختلف هزینه کرده‌اند.

از آنجا که بخش بزرگی از اقتصاد کشورهای توسعه‌یافته، به‌ویژه آمریکا، بر پایه مصرف خانوارها استوار است، تغییرات این شاخص می‌تواند نشانه‌ای از رشد یا ضعف اقتصاد باشد.

🎯 اهمیت:
افزایش Retail Sales معمولاً نشانه رشد اقتصادی و افزایش اعتماد مصرف‌کنندگان است، در حالی که کاهش آن می‌تواند هشداری برای کاهش تقاضا و احتمال رکود اقتصادی باشد. این گزارش بر بازارهای طلا، دلار، بورس و تصمیمات بانک‌های مرکزی تأثیر قابل‌توجهی دارد.
"""

    await update.message.reply_text(text)