from telegram import Update
from telegram.ext import ContextTypes


async def tapering(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
✂️ تیپرینگ (Tapering)

تیپرینگ به معنای کاهش تدریجی حجم خرید دارایی‌ها توسط بانک مرکزی است. این سیاست معمولاً پس از اجرای برنامه تسهیل کمی (QE) و زمانی که اقتصاد بهبود پیدا کرده باشد، اجرا می‌شود. در تیپرینگ، بانک مرکزی خرید اوراق قرضه را به‌تدریج کاهش می‌دهد، اما هنوز ترازنامه خود را کوچک نمی‌کند.

بسیاری افراد تیپرینگ را با QT اشتباه می‌گیرند؛ در حالی که تیپرینگ تنها به معنای کاهش سرعت خرید دارایی‌ها است، اما QT به معنای کاهش واقعی دارایی‌های بانک مرکزی و جمع‌آوری نقدینگی از اقتصاد است.

🎯 اهمیت:
اعلام تیپرینگ معمولاً اولین سیگنال بانک‌های مرکزی برای پایان سیاست‌های انبساطی است و می‌تواند بر نرخ بهره، ارزش دلار، قیمت طلا، بازار سهام و ارزهای دیجیتال تأثیر قابل‌توجهی داشته باشد.
"""

    await update.message.reply_text(text)