from telegram import Update
from telegram.ext import ContextTypes


async def trade_balance(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
⚖️ تراز تجاری (Trade Balance)

تراز تجاری به اختلاف بین ارزش صادرات و واردات کالا و خدمات یک کشور در یک بازه زمانی مشخص گفته می‌شود. اگر ارزش صادرات بیشتر از واردات باشد، کشور دارای مازاد تجاری (Trade Surplus) است و اگر واردات بیشتر از صادرات باشد، کسری تجاری (Trade Deficit) ایجاد می‌شود.

تراز تجاری یکی از مهم‌ترین شاخص‌های سنجش وضعیت اقتصاد و قدرت رقابت یک کشور در بازارهای جهانی است و نقش مهمی در ارزش پول ملی، رشد اقتصادی و جریان سرمایه دارد.

🎯 اهمیت:
بهبود تراز تجاری معمولاً موجب تقویت ارزش پول ملی و افزایش رشد اقتصادی می‌شود، در حالی که کسری تجاری طولانی‌مدت می‌تواند فشار بر نرخ ارز، تورم و رشد اقتصادی وارد کند.
"""

    await update.message.reply_text(text)