from telegram import Update
from telegram.ext import ContextTypes


async def unemployment(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
👥 نرخ بیکاری (Unemployment Rate)

نرخ بیکاری درصد افرادی را نشان می‌دهد که در سن کار قرار دارند، آماده کار هستند و به دنبال شغل می‌گردند، اما موفق به پیدا کردن کار نشده‌اند. این شاخص یکی از مهم‌ترین معیارهای سنجش وضعیت بازار کار و سلامت اقتصاد هر کشور است.

کاهش نرخ بیکاری معمولاً نشان‌دهنده رشد اقتصادی، افزایش اشتغال و رونق کسب‌وکارها است، در حالی که افزایش آن می‌تواند نشانه کند شدن اقتصاد یا ورود به رکود باشد.

🎯 اهمیت:
نرخ بیکاری تأثیر مستقیمی بر سیاست‌های بانک‌های مرکزی، نرخ بهره، ارزش ارز، بازار سهام، قیمت طلا و تصمیمات سرمایه‌گذاران دارد و یکی از مهم‌ترین گزارش‌های اقتصادی هر کشور محسوب می‌شود.
"""

    await update.message.reply_text(text)