from telegram import Update
from telegram.ext import ContextTypes


async def yield_curve(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    text = """
📈 منحنی بازده (Yield Curve)

منحنی بازده یا Yield Curve نموداری است که نرخ بازده اوراق قرضه دولتی با سررسیدهای مختلف را نمایش می‌دهد. این منحنی نشان می‌دهد سرمایه‌گذاران برای وام دادن پول به دولت در دوره‌های زمانی متفاوت چه میزان سود انتظار دارند.

در شرایط عادی، اوراق با سررسید بلندمدت بازده بیشتری نسبت به اوراق کوتاه‌مدت دارند؛ اما اگر منحنی بازده معکوس شود، یعنی نرخ بازده اوراق کوتاه‌مدت از بلندمدت بیشتر شود، معمولاً به عنوان یکی از مهم‌ترین هشدارهای وقوع رکود اقتصادی شناخته می‌شود.

🎯 اهمیت:
منحنی بازده یکی از معتبرترین شاخص‌های پیش‌بینی وضعیت اقتصاد است و تغییرات آن می‌تواند بر بازار سهام، نرخ بهره، ارزش دلار، قیمت طلا و تصمیمات سرمایه‌گذاران و بانک‌های مرکزی تأثیر قابل توجهی داشته باشد.
"""

    await update.message.reply_text(text)