from telegram import Update
from telegram.ext import ContextTypes


async def active_passive_income_intro(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):
    await update.message.reply_text(
        """
💼 درآمد فعال و غیرفعال

━━━━━━━━━━━━━━━━━━

💼 درآمد فعال

درآمدی است که در ازای
زمان و کار مستقیم
دریافت می‌کنید.

مثال:

👨‍💻 حقوق کارمندی

👨‍⚕️ پزشکی

👨‍🏫 تدریس

👨‍🔧 تعمیرات

━━━━━━━━━━━━━━━━━━

💰 درآمد غیرفعال

درآمدی است که
بدون نیاز به حضور دائمی
تولید می‌شود.

مثال:

🏠 اجاره ملک

📈 سود سهام

🥇 سرمایه‌گذاری طلا

₿ سرمایه‌گذاری بلندمدت

📚 فروش دوره آموزشی

🤖 درآمد از ربات

━━━━━━━━━━━━━━━━━━

📌 افراد ثروتمند
تلاش می‌کنند
درآمد فعال را به

درآمد غیرفعال

تبدیل کنند.

زیرا درآمد غیرفعال
در زمان خواب نیز
برای شما پول تولید می‌کند.
"""
    )