from telegram import Update
from telegram.ext import ContextTypes


async def goal_saving_intro(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    if update.message is None:
        return

    text = """
🎯 پس‌انداز هدف چیست؟

پس‌انداز هدف یعنی:

مشخص کنید برای رسیدن به یک هدف مالی
(خانه، خودرو، سرمایه‌گذاری، بازنشستگی و...)

چقدر باید هر ماه پس‌انداز کنید.

━━━━━━━━━━━━━━━━━━

فرض کنید:

🏠 هدف:
خرید خانه

💰 قیمت خانه:
۵ میلیارد تومان

💵 سرمایه فعلی:
۵۰۰ میلیون تومان

📈 سود سرمایه:
۳۰٪ سالانه

📅 مدت:
۱۰ سال

سپس محاسبه می‌کنیم:

✅ هر ماه چقدر باید پس‌انداز کنید
یا

✅ در پایان دوره چقدر سرمایه خواهید داشت.

━━━━━━━━━━━━━━━━━━

مزیت این روش:

✔ هدف مالی مشخص می‌شود.
✔ برنامه‌ریزی آسان‌تر می‌شود.
✔ احتمال رسیدن به هدف بسیار بیشتر می‌شود.

━━━━━━━━━━━━━━━━━━

📌 جمله معروف:

«هدفی که برای آن برنامه داشته باشید،
احتمال رسیدن به آن چندین برابر بیشتر است.»
"""

    await update.message.reply_text(text)