from telegram import Update
from telegram.ext import ContextTypes


async def time_value_example(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):
    text = """
📈 مثال واقعی ارزش زمانی پول

فرض کنید:

💰 امروز:
100 میلیون تومان دارید.

تورم سالانه:
30٪

اگر امروز این پول را سرمایه‌گذاری نکنید،
سال آینده همان 100 میلیون تومان را خواهید داشت.

اما قدرت خرید آن تقریباً معادل:

76.9 میلیون تومان امروز خواهد بود.

❌ یعنی بدون اینکه پول خرج کنید،
قدرت خریدتان کاهش پیدا کرده است.

اگر همان پول را با سود 30٪ سرمایه‌گذاری کنید:

100,000,000
⬇
130,000,000

در این حالت ارزش سرمایه شما با نرخ تورم حفظ می‌شود.

🎯 نتیجه:

اگر بازده سرمایه کمتر از تورم باشد،
در واقع هر سال فقیرتر می‌شوید.
"""

    await update.message.reply_text(text)