from telegram import Update
from telegram.ext import ContextTypes


async def purchasing_power_intro(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    if update.message is None:
        return

    text = """
💵 قدرت خرید چیست؟

قدرت خرید یعنی:

مقدار کالا و خدماتی که با مقدار مشخصی پول می‌توان خرید.

━━━━━━━━━━━━━━━━━━

مثال:

📅 سال ۱۴۰۰

با ۱ میلیون تومان
می‌توانستید حدود ۱۰ کیلو گوشت بخرید.

📅 سال ۱۴۰۵

با همان ۱ میلیون تومان
شاید فقط ۳ کیلو گوشت بخرید.

یعنی:

قدرت خرید کاهش پیدا کرده است.

━━━━━━━━━━━━━━━━━━

مهم‌ترین عامل کاهش قدرت خرید:

📈 تورم

هرچه تورم بیشتر باشد،
ارزش واقعی پول کمتر می‌شود.

━━━━━━━━━━━━━━━━━━

قانون مهم:

اگر درآمد شما
کمتر از نرخ تورم رشد کند،

هر سال
فقیرتر خواهید شد.

اگر درآمدتان
بیشتر از نرخ تورم رشد کند،

قدرت خرید شما افزایش پیدا می‌کند.
"""

    await update.message.reply_text(text)