from telegram import Update
from telegram.ext import ContextTypes


async def roi_example(
    update: Update,
    context: ContextTypes.DEFAULT_TYPE,
):

    await update.message.reply_text(
        """
📈 مثال واقعی ROI

فرض کنید:

💰 سرمایه اولیه:

100,000,000 تومان

💵 ارزش فروش:

160,000,000 تومان

━━━━━━━━━━━━━━━━━━

سود:

60,000,000 تومان

━━━━━━━━━━━━━━━━━━

ROI:

60%

━━━━━━━━━━━━━━━━━━

یعنی:

اگر امروز
100 میلیون تومان

سرمایه‌گذاری کرده باشید

و بعداً

160 میلیون تومان

دریافت کنید

بازده سرمایه‌گذاری شما

60٪

بوده است.

📌 آلبرت اینشتین گفته است:

«مهم نیست چقدر پول در می‌آورید،
مهم این است که چند درصد از سرمایه‌تان رشد می‌کند.»
"""
    )