from telegram import ReplyKeyboardMarkup


macroeconomics_keyboard = ReplyKeyboardMarkup(
    [
        ["📈 تورم", "📊 CPI"],
        ["📉 Core CPI", "🏭 PPI"],
        ["🌍 GDP", "💰 نرخ بهره"],
        ["🏦 FOMC", "🎯 Dot Plot"],
        ["💼 NFP", "🏢 PMI"],
        ["💳 PCE", "💵 QE"],
        ["📉 QT", "✂️ Tapering"],
        ["💲 شاخص DXY", "💸 نقدینگی"],
        ["🏛 پایه پولی", "💵 عرضه پول"],
        ["📉 رکود", "🔄 چرخه اقتصادی"],
        ["📈 منحنی بازده", "🏦 فدرال رزرو"],
        ["🏦 ECB", "🏦 BOJ"],
        ["💬 انتظارات تورمی", "🛒 خرده فروشی"],
        ["👥 اعتماد مصرف‌کننده", "🏭 اعتماد تولیدکننده"],
        ["⚖️ تراز تجاری", "🌐 حساب جاری"],
        ["📉 کسری بودجه", "🏛 بدهی دولت"],
        ["💱 نرخ ارز", "💰 قدرت خرید"],
        ["🏠 خانه"],
    ],
    resize_keyboard=True,
)