# ==========================
# قیمت‌های ارز
# ==========================

CURRENCY_PRICES = {
    "دلار آمریکا": 166815,
    "تتر": 169000,
    "درهم امارات": 45450,
    "یورو": 193800,
    "پوند انگلیس": 226500,
    "لیر ترکیه": 4200,
}

# ==========================
# قیمت‌های طلا و سکه
# ==========================

GOLD_PRICES = {
    "طلای 18 عیار": 16333400,
    "طلای 24 عیار": 21778000,
    "طلای آبشده": 70780000,

    "سکه امامی": 166005000,
    "سکه بهار آزادی": 152000000,
    "نیم سکه": 93000000,
    "ربع سکه": 53000000,
    "سکه گرمی": 30000000,
}

# ==========================
# قیمت‌های جهانی
# ==========================

GLOBAL_PRICES = {
    "اونس": 4138,
    "بیت کوین": 118000,
    "اتریوم": 3900,
}